Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Contains information used to determine the location of a point relative to a tree-view control
fr: Contient des informations utilisées pour déterminer la position d'un point par rapport à un contrôle tree-view

source: Specifies or receives attributes of a tree-view item
fr: Indique ou reçoit attributs d'un élément tree-view

source: Contains the data found when finding a file
fr: Contient les données trouvées lors de la recherche d'un fichier

source: The WINDOWPLACEMENT structure contains information about the placement of a window on the screen
fr: La structure WINDOWPLACEMENT contient des informations sur le placement d'une fenêtre sur l'écran

source: The WINDOWPOS structure contains information about the size and position of a window
fr: La structure WINDOWPOS contient des informations sur la taille et la position d'une fenêtre

source: Calculates the tangent of a number.
fr: Calcule la tangente d'un nombre.

source: Returns the trigonometric tangent of the number.
fr: Retourne la tangente trigonométrique du nombre.

source: Note that Tan() is "infinite" for ...
fr: Notez que Tan() est "infini" pour ...

source: -3PI/2, -PI/2, PI/2, 3PI/2, 5PI/2, ... and tends to return 1.63317787283838e+016 for such multiples of Pi-halves.
fr: -3PI/2, -PI/2, PI/2, 3PI/2, 5PI/2, ...et tend à retourner 1.63317787283838e+016 pour les multiples de Pi/2.

source: Assign a Local variable the tangent of PI / 4.
fr: Assigne une variable locale avec la tangente de PI / 4.

source: Assign a Local variable the tangent of 90 degrees (firstly converted to radians).
fr: Assigne une variable locale avec la tangente de 90 degrés (d'abord converti en radians).

source: The main socket identifier (SocketID) as returned by a TCPListen function.
fr: L’identifiant du socket principale (SocketID) tel que retourné par un appel à la fonction TCPListen.

source: the connected socket identifier.
fr: Retourne l'identifiant du socket connecté.

source: windows API WSAGetError return value (see MSDN).
fr: Valeur de retour de l'API windows WSAGetError (Consultez MSDN).

source: I am the server, start me first!
fr: Je suis le serveur, démarrez-moi d'abord!

source: (Start in second the TCPConnect example script).
fr: (Démarre dans la deuxième exemple de script TCPConnect).

source: Start the TCP service.
fr: Démarre le service TCP.

source: Register OnAutoItExit to be called when the script is closed.
fr: Crée OnAutoItExit qui sera appelé lorsque le script se fermera.

source: Assign Local variables the loopback IP Address and the Port.
fr: Affecte des variables locales avec bouclage adresse IP et le port.

source: This IP Address only works for testing on your own computer.
fr: Cette adresse IP ne fonctionne que pour les tests sur votre propre ordinateur.

source: Port used for the connection.
fr: Port utilisé pour la connexion.

source: Bind to the IP Address and Port specified with a maximum of 100 pending connexions
fr: Se connecte à l'adresse IP sur le port spécifié avec un maximum de 100 connexions en attente

source: (Take a look at the example of this function for further details).
fr: (Regardez l'exemple de cette fonction pour plus de détails).

source: Someone is probably already listening on this IP Address and Port (script already running?).
fr: Quelqu'un est probablement déjà à l'écoute sur cette adresse IP et ce port (scénario déjà en cours?).

source: Assign Local variable to be used by Listening and Client sockets.
fr: Affecte la variable locale pour l'écoute et sockets clients.

source: Wait for someone to connect (Unlimited).
fr: Attend que quelqu'un se connecte (illimité).

source: Accept incomming connexions if present (Socket to close when finished; one socket per client).
fr: Accepte les connexions entrantes si présent (Socket pour fermer une fois terminé, un socket par client).

source: if different from -1 a client is connected.
fr: si elle est différente de -1 un client est connecté.

source: Close the Listening socket to allow afterward binds.
fr: Ferme le socket d'écoute pour permettre pour permettre d'autres connexions par la suite.

source: Close the socket.
fr: Ferme le socket.

source: Close the TCP service.
fr: Ferme le service TCP.

source: Check the Example 1 to get the useful comments, this example only demonstrates the SocketToIP user-defined function.
fr: Consultez l'exemple 1 pour obtenir les commentaires utiles, cet exemple montre la fonction définie par l'utilisateur SocketToIP.

source: Retrieve the IP Address associated with the accepted socket and assign it to a Local variable.
fr: Récupére l'adresse IP associée au socket acceptée et l'assigne à une variable locale.

source: The above function does NOT work with the Listen socket, you can also use it with the socket returned by the TCPConnect function.
fr: La fonction ci-dessus ne fonctionne pas avec le socket Listen, vous pouvez également l'utiliser avec le socket renvoyée par la fonction TCPConnect.

source: Display the sucessful message with the client IP Address.
fr: Affiche un message de réussite avec l'adresse IP du client.

source: The socket identifier (SocketID) as returned by a TCPListen or TCPAccept functions.
fr: L'identifiant du socket (SocketID) tel que retourné par un appel à la fonction TCPListen ou TCPAccept.

source: 0 and sets the @error flag to non-zero?
fr: Retourne 0 et @error <> 0.

source: Start First clicking on "1.
fr: Commencez d'abord par cliquer sur "1.

source: Server"
fr: Serveur"

source: Then start a second instance of the script selecting "2.Client"
fr: Puis démarrez une seconde instance du script en sélectionnant "2.Client"

source: Assign a Local variable the socket and connect to a listening socket with the IP Address and Port specified.
fr: Assigne une variable locale avec la socket et se connecter à une socket d'écoute avec l'adresse IP et le port spécifié.

source: The server is probably offline/port is not opened on the server.
fr: Le serveur est probablement hors ligne ou le port n'est pas ouvert sur le serveur.

source: Send the string "tata" to the server.
fr: Envoie la chaîne "tata" au serveur.

source: Assign a Local variable the socket and bind to the IP Address and Port specified with a maximum of 100 pending connexions.
fr: Assigne une variable locale avec la socket et de se connecte à l'adresse IP et le port spécifié avec un maximum de 100 connexions en attente.

source: Assign a Local variable to be used by the Client socket.
fr: Assigne une variable locale pour être utilisé par le socket client.

source: Assign a Local variable the data received.
fr: Assigne une variable locale avec les données reçues.

source: we're waiting for the string "tata" OR "toto" (example script TCPRecv):
fr: nous attendons la chaîne "tata" OU "toto" (exemple de script TCPRecv):

source: 4 bytes length.
fr: 4 octets de longueur.

source: If you don't know how much length will be the data,
fr: Si vous ne connaissez pas la longueur des données,

source: use e.g:
fr: utilisez, par exemple :

source: 2048 for maxlen parameter and call the function until the it returns nothing/error.
fr: 2048 pour paramètre 'maxlen' et appelez la fonction jusqu'à ce qu'elle ne retourne rien ou erreur.

source: Display the string received.
fr: Affiche la chaîne reçue.

source: Internet Protocol dotted address(IpV4) as "192.162.1.1".
fr: Adresse de protocole Internet séparé par des points(IpV4) tel que:"192.162.1.1".

source: port on which the created socket will be connected.
fr: Port sur lequel le socket créé sera connecté.

source: the main socket identifier.
fr: Retourne l'identifiant principal du socket.

source: -1 or 0 and sets the @error flag to non-zero.
fr: Retourne -1 ou 0 et @error <> 0.

source: 1 IPAddr is incorrect.
fr: 1 = IPAddr incorrect.

source: 2 port is incorrect.
fr: 2 = port incorrect.

source: Windows API WSAGetError return value (see MSDN).
fr: Valeur retournée par l'API windows WSAGetError (Consultez MSDN).

source: This function is used by a client to communicate with the server.
fr: Cette fonction est utilisée par un client pour communiquer avec le serveur.

source: I am the client, start me after the server!
fr: Je suis le client, démarrez-moi après le serveur!

source: (Start first the TCPAccept example script).
fr: (Démarrez d'abord l'exemple du script TCPAccept).

source: Assign a Local variable the socket and connect to a Listening socket with the IP Address and Port specified.
fr: Assigne une variable locale avec le socket et se connecte à un socket d'écoute avec l'adresse IP et le port spécifié.

source: Maximum length of the queue of pending connections.
fr: Longueur maximale de la file d'attente des connexions en attente.

source: By default the maximum reasonable value will be set.
fr: Par défaut, une valeur maximale raisonnable est définie.

source: Assign a Local variable the Listening socket and bind to the IP Address and Port specified with a maximum of 100 pending connexions.
fr: Assigne une variable locale avec le socket d'écoute et se connecte à l'adresse IP et au port spécifiés avec un maximum de 100 connexions en attente.

source: You can only listen on private IPs, such as the one used here;
fr: Vous pouvez seulement écouter sur des IPs privées, comme celui utilisé ici;

source: or on the range of 192 to 223 (generally 192.168.X.X, use @IPAddress1 to test on your local IP [you will need another computer]).
fr: ou sur la plage de 192 à 223 (généralement 192.168.X.X, utilisez @IPAddress1 pour tester sur votre IP locale (vous aurez besoin d'un autre ordinateur).

source: The Listen socket identifier is only used for the TCP Accept function.
fr: L'identifiant de la socket Listen est utilisée uniquement pour la fonction TCPAccept.

source: While not closed, any other program can NOT bind to the same IP Address and Port.
fr: Tant que non fermée, aucun autre programme ne peut pas se connecter avec la même adresse IP et le même port.

source: String containing an Internet name.
fr: Chaîne de caractères contenant le nom de domaine.

source: a string containing IP address corresponding to the name.
fr: Retourne une chaîne de caractères contenant l'adresse IP correspondant au nom de domaine.

source: "" and sets the @error flag to non-zero.
fr: Retourne "" et @error <> 0.

source: TCPStartup() is needed before this call.
fr: TCPStartup() est nécessaire avant un appel à cette fonction.

source: Assign a Local variable the IP address of www.autoitscript.com.
fr: Assigne une variable locale avec l'adresse IP: www.autoitscript.com.

source: Display the IP address.
fr: Affiche l'adresse IP.

source: The connected socket identifier (SocketID) as returned by a TCPAccept or a TCPConnect function.
fr: L'ID du socket principal (SocketID) tel que retourné par un appel à la fonction TCPAccept ou TCPConnect.

source: max # of characters to receive.
fr: Nombre maximum de caractères à recevoir.

source: Forces the function to return binary data if set to 1 (default is 0, and will auto detect between binary/string).
fr: Si flag=1, force la fonction à retourner les données en binaire.

source: 0 - (Default) will auto detect between binary/string
fr: 0 - (par défaut) détecte automatiquement binaire/chaîne

source: 1 - return binary data
fr: 1 - retourne les données sous forme binaire

source: the binary/string sent by the connected socket.
fr: Retourne les données binaire/chaîne envoyées par le socket connecté.

source: -1 Socket error
fr: -1 Erreur de socket.

source: For backwards compatibility reasons this function will try to return strings by default.
fr: Pour des raisons de rétro-compatibilité, cette fonction essayera de retourner une chaine de caractère par défaut.

source: If null (0x00) characters are received then the return value will be a binary type.
fr: Si des caractères null (0x00) sont reçus alors la valeur de retour sera de type binaire.

source: To force the function to always return binary data (the most sensible option) then use the "flag" parameter set to 1.
fr: Pour forcer la fonction à retourner des données binaires (l'option la plus logique) alors mettre le paramètre "flag" à 1.

source: If Unicode strings need to be transmitted they must be encoded/decoded with StringToBinary()/BinaryToString().
fr: Si vous avez besoin de transmettre des chaînes Unicode, elles doivent être encodées/décodées avec StringToBinary()/BinaryToString().

source: Then start a second instance of the script selecting "2.
fr: Puis démarrez une seconde instance du script en sélectionnant "2.

source: (Start first the example 2 of the TCPSend function).
fr: (Commencez d'abord l'exemple 2 de la fonction TCPSend).

source: Assign a Local variable the path of the file which will be received.
fr: Assigne une variable locale avec le chemin du fichier qui sera reçu.

source: Assign a Local variable the handle of the file opened in binary overwrite mode.
fr: Assigne une variable locale avec le handle du fichier ouvert en mode écrasement binaire.

source: Assign Locales Constant variables the number representing 4 KiB; the binary code for the end of the file and the length of the binary code.
fr: Assigne des constantes locales avec le nombre représentant 4 Ko; le code binaire pour la fin du fichier, et la longueur du code binaire.

source: Assign a Local variable the empty binary data which will contain the binary data of the file.
fr: Assigne une variable locale avec les données binaires vide qui contiendra les données binaires du fichier.

source: Assign a Local variable to store the length of the data received.
fr: Assigne une variable locale pour stocker la longueur des données reçues.

source: Assign a Local variable a boolean.
fr: Assigne une variable locale avec un booléen.

source: If nothing is received, retry for the incoming data.
fr: Si rien n'est reçu, recommencez pour les données entrantes.

source: If the end of the file is reached.
fr: Si la fin du fichier est atteinte.

source: Strip the EOF code from the file data.
fr: Coupe le code de EOF dans le fichier des données.

source: Set the EOFReached to True.
fr: Définit EOFReached à True.

source: Close the file handle.
fr: Ferme Le handle du fichier.

source: Display the successful message.
fr: Affiche le message de succès.

source: The connected socket identifier (SocketID) as returned by a TCPConnect function.
fr: L'ID du socket principal (SocketID) tel que retourné par un appel à la fonction TCPConnect.

source: binary/string to be send to the connected socket.
fr: Chaine ou binaire devant être envoyé au socket connecté.

source: the number of bytes sent to the connected socket.
fr: Retourne le nombre d'octets envoyés au socket connecté.

source: (Start in second the example 2 of the TCPRecv function).
fr: (Commencez par l'exemple 2 de la fonction TCPRecv).

source: Assign a Local variable the path of a file chosen through a dialog box.
fr: Assigne une variable locale avec le chemin d'un fichier choisi par une boîte de dialogue.

source: Choose a file bigger than 4 kiB otherwise the first example is enough.
fr: Choisissez un fichier de plus de 4 Ko sinon le premier exemple est suffisant.

source: Assign a Local variable the size of the file previously chosen.
fr: Assigne une variable locale de la taille du fichier précédemment choisi.

source: Assign a Local variable the handle of the file opened in binary mode.
fr: Assigne une variable locale avec le handle du fichier ouvert en mode binaire.

source: Assign a Local variable the offset of the file being read.
fr: Assigne une variable locale avec l'offset du fichier en cours de lecture.

source: Assign a Local variable the number representing 4 KiB.
fr: Assigne une variable locale avec le nombre représentant 4 Ko.

source: The file is send by parts of 4 KiB.
fr: Le fichier est envoyé par parties de 4 Ko.

source: Send the binary data of the file to the server.
fr: Envoie les données binaires du fichier sur le serveur.

source: Set the file position to the current offset.
fr: Définit la position du fichier à l'offset courant.

source: The file is read from the position set to 4 KiB and directly wrapped into the TCPSend function.
fr: Le fichier est lu à partir de la position définie à 4 Ko et directement enveloppé dans la fonction TCPSend.

source: Increment the offset of 4 KiB to send the next 4 KiB data.
fr: Incrémente l'offset de 4 Ko pour envoyer les 4 prochains Ko de données.

source: Tell the client the file is fully sent with a code.
fr: Dit au client que le fichier est complètement envoyé avec un code.

source: windows API WSAStartup return value (see MSDN).
fr: Valeur retourné par l'API windows WSAStartup (Consultez MSDN).

source: There must be a TCPShutdown() call to avoid memory consumption.
fr: Il doit y avoir un appel à TCPShutdown() pour éviter une consommation de mémoire.

source: A script must call one TCPShutdown() call for every successful TCPStartup() call.
fr: Un script doit appeler un TCPShutdown() pour chaque appel réussi à un TCPStartup().

source: UDPStartup() is just an alias of TCPStartup().
fr: UDPStartup() n'est qu'un alias de TCPStartup().

source: Start the UDP service
fr: Démarre le service UDP.

source: Start the UDP service.
fr: Démarre le service UDP.

source: Close the UDP service.
fr: Ferme le service UDP.

source: Timer and Delay functions Reference
fr: Timer and Delay - Référence Fonctions

source: Pause script execution.
fr: Met l'exécution du script en pause.

source: Returns the difference in time from a previous call to TimerInit().
fr: Retourne la différence en temps à partir d'un précédent appel à TimerInit().

source: Returns a handle that can be passed to TimerDiff() to calculate the difference in milliseconds.
fr: Retourne un handle qui peut être passé à TimerDiff() pour calculer la différence en millisecondes.

source: Handle returned from a previous call to TimerInit().
fr: Handle retourné à partir d'un précédent appel à TimerInit().

source: Returns the time difference (in milliseconds) from a previous call to TimerInit().
fr: Retourne la différence de temps (en millisecondes) à partir d'un précédent appel à TimerInit().

source: Some processors are known to cause the function to return incorrect result.
fr: Quelques processeurs sont connus pour fausser les résultats de la fonction.

source: Begin the timer and store the handle in a variable.
fr: Démarre le chrono et stocke le handle dans une variable.

source: Sleep for 3 seconds.
fr: Pause pendant 3 secondes.

source: Find the difference in time from the previous call of TimerInit.
fr: Trouve la différence entre le temps de l'appel précédent de TimerInit.

source: The variable we stored the TimerInit handlem is passed as the "handle" to TimerDiff.
fr: La variable où nous avons stocké le handle de TimerInit est passé comme "handle" de TimerDiff.

source: The return value from TimerInit() should be treated as an opaque handle and should only be used to pass to TimerDiff().
fr: La valeur retournnée par TimerInit() devrait être traiter comme un handle opaque et devrait seulement être utilisé pour le passer à TimerDiff().

source: Any other usage of the return value is a potential error.
fr: D'autres utilisations de la valeur de retour conduisent à des erreurs.

source: Timers user defined functions Reference
fr: Timers - Référence

source: When using them you need to add a #include <Timers.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Timers.au3>.

source: The text of the tooltip.
fr: Le texte de l'info-bulle.

source: (An empty string clears a displaying tooltip)
fr: (Une chaîne vide efface l'affichage d'une info-bulle)

source: The x position of the tooltip.
fr: La position x de l'info-bulle.

source: The y position of the tooltip.
fr: La position y de l'info-bulle.

source: Pre-defined icon to show next to the title:Requires a title.
fr: Icône prédéfinie à afficher à côté du titre: nécessite un titre.

source: 2 = Center the tip at the x,y coordinates instead of using them for the upper left corner.
fr: 2 = Centre l'info-bulle aux coordonnées x, y au lieu de les utiliser pour le coin supérieur gauche.

source: 4 = Force the tooltip to always be visible confining it to monitor borders if necessary.
fr: 4 = Force l'info-bulle à être toujours visible, la confinant si nécessaire aux bords de l'écran.

source: If multiple monitors are used, then the tooltip will "snap-to" the nearest monitor.
fr: Si plusieurs moniteurs sont utilisés, alors l'info-bulle sera "snap-to" le moniteur le plus proche.

source: 0 when title length is greater than 99.
fr: Retourne 0 lorsque la longueur du titre est supérieur à 99.

source: To skip an optional parameter, leaving its default value intact, use the Default keyword.
fr: Pour passer un paramètre optionnel, en laissant sa valeur par défaut intacte, utilisez le mot-clé Default.

source: If the x and y coordinates are omitted, the tip is placed near the mouse cursor.
fr: Si les coordonnées x et y sont omises, l'info-bulle est placée près du curseur de la souris.

source: A Tooltip will appear until the script terminates or ToolTip("") is called.
fr: Une info-bulle s'affiche jusqu'à ce que le script se termine ou ToolTip("") soit appelée.

source: If using the center flag, the center of the tooltip will be at the coordinates specified.
fr: Si vous utilisez le flag 'center', le centre de l'info-bulle sera aux coordonnées spécifiées.

source: If using the center flag with a Balloon Tip, the stem will be centered on the balloon and will point to the coordinates specified.
fr: Si vous utilisez le flag 'center' avec la forme ballon, la tige sera centrée sur le ballon et pointera vers les coordonnées spécifiées.

source: This will create a tooltip in the upper left of the screen
fr: Création d'une info-bulle dans le coin supérieur gauche de l'écran

source: Sleep to give tooltip time to display
fr: Pause pout donner à l'info-bulle le temps de s'afficher

source: Tray functions Reference
fr: Tray - Référence Fonctions

source: Creates a menuitem control for the tray.
fr: Crée un contrôle menuitem dans la zone de notification.

source: Creates a menu control for the tray menu.
fr: Crée un contrôle menu pour le menu de la zone de notification.

source: Polls the tray to see if any events have occurred.
fr: Interroge la zone de notification pour savoir si des événements ont été déclenchés.

source: Deletes a menu/item control from the tray menu.
fr: Supprime un contrôle menu ou item dans le menu de la zone de notification.

source: Returns the handle for a tray menu(item).
fr: Retourne le handle d'un menu ou d'un item de la zone de notification.

source: Gets the itemtext of a tray menu/item control.
fr: Obtient le texte d'un contrôle menu ou item de la zone de notification.

source: Defines a user-defined function to be called when a tray item is clicked.
fr: Définit une fonction utilisateur qui est appelée quand un item de la zone de notification est cliqué.

source: Sets the state of a tray menu/item control.
fr: Définit l'état d'un contrôle menu ou item de la zone de notification.

source: Sets the itemtext of a tray menu/item control.
fr: Définit le texte d'un contrôle menu ou item de menu de la zone de notification.

source: Sets the clickmode of the tray icon - what mouseclicks will display the tray menu.
fr: Définit le 'ClickMode' de l'icône de la zone de notification - quel clic de souris affiche le menu.

source: Loads/Sets a specified tray icon.
fr: Charge/Définit l'icône spécifiée pour la zone de notification.

source: Defines a user function to be called when a special tray action happens.
fr: Définit une fonction utilisateur qui sera appelée lors d'une action spéciale dans la zone de notification.

source: Loads/Sets a specified tray pause icon.
fr: Charge/Définit l'icône 'pause' spécifiée pour la zone de notification.
